
#Область ПрограммныйИнтерфейс

// 
////
Процедура ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт 
    
    МассивМетаданных = ДымовыеТесты_Метаданные.МетаданныеКритерииОтбора();
    НаборТестов = ДымовыеТесты_НаборыТестов.НаборТестовКритерииОтбора(Теги());
    
    Для Каждого ЭлементМассива Из МассивМетаданных Цикл
        ДымовыеТесты_НаборыТестов.ДобавитьНаборТестов(ЭлементМассива, НаборТестов);
    КонецЦикла;
    
КонецПроцедуры

#Область Тесты

// 
////
Процедура ОткрытьФормуОбъекта(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуОбъекта(ТипМетаданных(), Имя);
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ТипМетаданных() 
    
    Возврат "КритерийОтбора";
    
КонецФункции

// 
////
Функция Теги() 
    
    Возврат "КритерийОтбора";
    
КонецФункции

#КонецОбласти
