
#Область ПрограммныйИнтерфейс

// 
////
Процедура ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт 
    
    МассивМетаданных = ДымовыеТесты_МетаданныеСервер.МетаданныеХранилищаНастроек();
    НаборТестов = ДымовыеТесты_НаборыТестов.НаборТестовХранилищаНастроек(Теги());
    
    Для Каждого ЭлементМассива Из МассивМетаданных Цикл
        ДымовыеТесты_НаборыТестов.ДобавитьНаборТестов(ЭлементМассива, НаборТестов);
    КонецЦикла;
    
КонецПроцедуры

#Область Тесты

// 
////
Процедура ОткрытьФормуЗагрузки(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуЗагрузки(ТипМетаданных(), Имя);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуСохранения(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуСохранения(ТипМетаданных(), Имя);
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ТипМетаданных() 
    
    Возврат "ХранилищеНастроек";
    
КонецФункции

// 
////
Функция Теги() 
    
    Возврат "ХранилищеНастроек";
    
КонецФункции

#КонецОбласти
