
#Область СлужебныйПрограммныйИнтерфейс

#Область Тесты

// 
////
Процедура ОткрытьФормуСписка(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуСписка(Параметры);
    
КонецПроцедуры

#КонецОбласти

// 
////
Процедура ИсполняемыеСценарии() Экспорт 
    
    Если ДТС_Настройки.Пропустить(ИдентификаторМодуля()) Тогда
        Возврат;
    КонецЕсли;
    
    МетаданныеКритерииОтбора = ДТС_МетаданныеСервер.МетаданныеКритерийОтбора();
    
    Для Каждого ОписаниеМетаданных Из МетаданныеКритерииОтбора Цикл
        Если ДТС_Настройки.Пропустить(ОписаниеМетаданных.Идентификатор) Тогда
            Продолжить;
        КонецЕсли;
        
        НаборТестов = ДТС_НаборыТестов.НаборТестовКритерияОтбора(ОписаниеМетаданных);
        ДТС_НаборыТестов.ДобавитьНаборТестов(
            ОписаниеМетаданных.Идентификатор, 
            ОписаниеМетаданных.Представление, 
            НаборТестов
        );
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ИдентификаторМодуля() 
    
    Возврат "КритерийОтбора";
    
КонецФункции

#КонецОбласти
