
#Область СлужебныйПрограммныйИнтерфейс

// 
////
Функция СлучайнаяСсылка(Тип, Имя, ПараметрыОтбора) Экспорт 
    
    ИмяТаблицы = ДТС_МетаданныеСервер.ПолноеИмя(Тип, Имя);
    ВыбираемыеПоля = ЮТОбщий.ЗначениеВМассиве("Ссылка");
    ОписаниеЗапроса = ОписаниеЗапроса(ИмяТаблицы, ВыбираемыеПоля, ПараметрыОтбора);
    Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
    
    Если Результат.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Индекс = ЮТТестовыеДанные.СлучайноеЧисло(0, Результат.Количество() - 1);
    Возврат Результат[Индекс].Ссылка;
    
КонецФункции

// 
////
Функция СлучайнаяЗапись(Тип, Имя, ПараметрыОтбора) Экспорт 
    
    ИмяТаблицы = ДТС_МетаданныеСервер.ПолноеИмя(Тип, Имя);
    ВыбираемыеПоля = ДТС_МетаданныеСервер.КлючевыеПоляЗаписи(Тип, Имя);
    ОписаниеЗапроса = ОписаниеЗапроса(ИмяТаблицы, ВыбираемыеПоля, ПараметрыОтбора);
    Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
    
    Если Результат.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Индекс = ЮТТестовыеДанные.СлучайноеЧисло(0, Результат.Количество() - 1);
    ВыбраннаяСтрока = Результат[Индекс];
    ЗначенияКлюча = Новый Структура;
    
    Для Каждого ЭлементМассива Из ВыбираемыеПоля Цикл
        ЗначенияКлюча.Вставить(ЭлементМассива, ВыбраннаяСтрока[ЭлементМассива]);
    КонецЦикла;
    
    Возврат ДТС_МетаданныеСервер.МенеджерОбьекта(Тип, Имя).СоздатьКлючЗаписи(ЗначенияКлюча);
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ОписаниеЗапроса(ИмяТаблицы, ВыбираемыеПоля, ПараметрыОтбора) 
    
    ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
    ЗаполнитьЗначенияСвойств(ОписаниеЗапроса, ПараметрыОтбора);
    ОписаниеЗапроса.ИмяТаблицы = ИмяТаблицы;
    ОписаниеЗапроса.КоличествоЗаписей = ПараметрыОтбора.КоличествоЗаписей;
    ОписаниеЗапроса.ВыбираемыеПоля = ВыбираемыеПоля;
    Возврат ОписаниеЗапроса;
    
КонецФункции

#КонецОбласти
