
#Область СлужебныйПрограммныйИнтерфейс

// 
////
Процедура ЗаписатьОбъект(Ссылка) Экспорт 
    
    Объект = Ссылка.ПолучитьОбъект();
    Объект.Записать();
    
КонецПроцедуры

// 
////
Процедура ПровестиОбъект(Ссылка) Экспорт 
    
    Объект = Ссылка.ПолучитьОбъект();
    Объект.Записать(РежимЗаписиДокумента.Проведение);
    
КонецПроцедуры

// 
////
Процедура ПроверитьМакетСКД(ОписаниеМетаданных) Экспорт 
    
    МенеджерОбьекта = ДТС_МетаданныеСервер.МенеджерОбьекта(ОписаниеМетаданных.Тип, ОписаниеМетаданных.Имя);
    Макет = МенеджерОбьекта.ПолучитьМакет(ОписаниеМетаданных.Макет);
    ИнициализироватьМакетСКД(Макет);
    
КонецПроцедуры

// 
////
Процедура ПроверитьОбщийМакетСКД(ОписаниеМетаданных) Экспорт 
    
    Макет = ПолучитьОбщийМакет(ОписаниеМетаданных.Имя);
    ИнициализироватьМакетСКД(Макет);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// TODO 
////
Процедура ИнициализироватьМакетСКД(Макет) 
    
    ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Макет);
    КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
    
КонецПроцедуры

#КонецОбласти
