
#Область ПрограммныйИнтерфейс

// 
////
Процедура ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт 

    МассивМетаданных = ДымовыеТесты_Метаданные.МетаданныеОбработки();
    НаборТестов = ДымовыеТесты_НаборыТестов.НаборТестовОбработки(Теги());
    
    Для Каждого ЭлементМассива Из МассивМетаданных Цикл
        ДымовыеТесты_НаборыТестов.ДобавитьНаборТестов(ЭлементМассива, НаборТестов);
    КонецЦикла;
    
КонецПроцедуры

#Область Тесты

// TODO 
////
Процедура _ОткрытьФорму(Имя) Экспорт 
    
    ДымовыеТесты_Тесты._ОткрытьФорму(ТипМетаданных(), Имя);
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ТипМетаданных() 
    
    Возврат "Обработка";
    
КонецФункции

// 
////
Функция Теги() 
    
    Возврат "Обработка";
    
КонецФункции

#КонецОбласти
