
#Область ПрограммныйИнтерфейс

// 
////
Процедура ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт 

    МассивМетаданных = ДымовыеТесты_МетаданныеСервер.МетаданныеОтчеты();
    НаборТестов = ДымовыеТесты_НаборыТестов.НаборТестовОтчеты(Теги());
    
    Для Каждого ЭлементМассива Из МассивМетаданных Цикл
        ДымовыеТесты_НаборыТестов.ДобавитьНаборТестов(ЭлементМассива, НаборТестов);
    КонецЦикла;
    
КонецПроцедуры

#Область Тесты

// 
////
Процедура ОткрытьФормуОбъекта(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуОбъекта(ТипМетаданных(), Имя);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВарианта(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуВарианта(ТипМетаданных(), Имя);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуНастроек(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуНастроек(ТипМетаданных(), Имя);
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ТипМетаданных() 
    
    Возврат "Отчет";
    
КонецФункции

// 
////
Функция Теги() 
    
    Возврат "Отчет";
    
КонецФункции

#КонецОбласти
