
#Область СлужебныйПрограммныйИнтерфейс

#Область ОписаниеТестов 

// 
////
Функция ОписаниеТестаОткрытьФормуСписка(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаСписка");
    
    Возврат ОписаниеТеста("ОткрытьФормуСписка", "Открыть форму списка", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуВыбора(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаВыбора");
    
    Возврат ОписаниеТеста("ОткрытьФормуВыбора", "Открыть форму выбора", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуОбъекта(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаОбъекта");
    
    Возврат ОписаниеТеста("ОткрытьФормуОбъекта", "Открыть форму объекта", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуВыбораГруппы(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаВыбораГруппы");
    
    Возврат ОписаниеТеста("ОткрытьФормуВыбораГруппы", "Открыть форму выбора группы", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуГруппы(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаГруппы");
    
    Возврат ОписаниеТеста("ОткрытьФормуГруппы", "Открыть форму группы", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуЗаписи(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаЗаписи");
    
    Возврат ОписаниеТеста("ОткрытьФормуЗаписи", "Открыть форму записи", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуЗагрузки(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаЗагрузки");
    
    Возврат ОписаниеТеста("ОткрытьФормуЗагрузки", "Открыть форму загрузки", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуСохранения(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаСохранения");
    
    Возврат ОписаниеТеста("ОткрытьФормуСохранения", "Открыть форму сохранения", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуВарианта(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаВарианта");
    
    Возврат ОписаниеТеста("ОткрытьФормуВарианта", "Открыть форму варианта", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФормуНастроек(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "ФормаНастроек");
    
    Возврат ОписаниеТеста("ОткрытьФормуНастроек", "Открыть форму настроек", НовыеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТестаОткрытьФорму(Теги) Экспорт 
    
    НовыеТеги = ДополнитьТеги(Теги, "Форма");
    
    Возврат ОписаниеТеста("_ОткрытьФорму", "Открыть форму", НовыеТеги);
    
КонецФункции

#КонецОбласти

#Область Тесты

// 
////
Процедура ОткрытьФормуСписка(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаСписка");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВыбора(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаВыбора");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуОбъекта(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаОбъекта");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВыбораГруппы(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаВыбораГруппы");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуГруппы(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаГруппы");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуЗаписи(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаЗаписи");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуЗагрузки(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаЗагрузки");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуСохранения(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаСохранения");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВарианта(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаВарианта");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуНастроек(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "ФормаНастроек");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

// 
////
Процедура _ОткрытьФорму(Тип, Имя) Экспорт 
    
    ИмяФормы = ИмяФормы(Тип, Имя, "Форма");
    ОткрытьЗакрытьФорму(ИмяФормы);
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ДополнитьТеги(Теги, ДополнительныеТеги) 
    
    Возврат СтрШаблон("%1,%2", Теги, ДополнительныеТеги);
    
КонецФункции

// 
////
Функция ОписаниеТеста(Метод, Представление, Теги) 
    
    Структура = Новый Структура;
    Структура.Вставить("Метод", Метод);
    Структура.Вставить("Представление", Представление);
    Структура.Вставить("Теги", Теги);
    
    Возврат Структура;
    
КонецФункции

// 
////
Функция ИмяФормы(Тип, Имя, ИмяФормы) 
    
    Возврат СтрШаблон("%1.%2.%3", Тип, Имя, ИмяФормы);
    
КонецФункции

// 
////
Процедура ОткрытьЗакрытьФорму(ИмяФормы) 
    
    // BSLLS:GetFormMethod-off
    Форма = ПолучитьФорму(ИмяФормы, , , Новый УникальныйИдентификатор);
    // BSLLS:GetFormMethod-on
    
    Если Форма = Неопределено Тогда
        ВызватьИсключение "Не удалось получить форму";
    КонецЕсли;
    
    Форма.Открыть();
    
    Если Форма.Открыта() Тогда
        Если ЭтоУправляемаяФорма(Форма) Тогда
            Форма.ОбновитьОтображениеДанных();
        Иначе
            Форма.Обновить();
        КонецЕсли;
        
        Форма.Модифицированность = Ложь;
        Форма.Закрыть();
        
        Если Форма.Открыта() Тогда
            ВызватьИсключение "Не удалось закрыть форму";
        КонецЕсли;
    Иначе
        ВызватьИсключение "Не удалось открыть форму";
    КонецЕсли;
    
КонецПроцедуры

// 
////
Функция ЭтоУправляемаяФорма(Форма) 
    
    Возврат ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения");
    
КонецФункции

#КонецОбласти
