
#Область СлужебныйПрограммныйИнтерфейс

#Область Тесты

// 
////
Процедура ОткрытьФормуСписка(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуСписка(Параметры);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВыбора(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуВыбора(Параметры);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуОбъекта(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуОбъекта(Параметры);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуСуществующегоОбъекта(Параметры) Экспорт 
    
    ПараметрыОтбора = ДТС_Настройки.ПараметрыОтбораБизнесПроцесса(Параметры);
    ДТС_Тесты.ОткрытьФормуОбъекта(Параметры, ПараметрыОтбора);
    
КонецПроцедуры

// 
////
Процедура ЗаписатьСуществующийОбъект(Параметры) Экспорт 
    
    ПараметрыОтбора = ДТС_Настройки.ПараметрыОтбораБизнесПроцесса(Параметры);
    ДТС_Тесты.ЗаписатьОбъект(Параметры, ПараметрыОтбора);
    
КонецПроцедуры

// 
////
Процедура ПроверитьМакетСКД(Параметры) Экспорт 
    
    ДТС_Тесты.ПроверитьМакетСКД(Параметры);
    
КонецПроцедуры

#КонецОбласти

// 
////
Процедура ИсполняемыеСценарии() Экспорт 
    
    Если ДТС_Настройки.Пропустить(ИдентификаторМодуля()) Тогда
        Возврат;
    КонецЕсли;
    
    МетаданныеБизнесПроцессы = ДТС_МетаданныеСервер.МетаданныеБизнесПроцессов();
    
    Для Каждого ОписаниеМетаданных Из МетаданныеБизнесПроцессы Цикл
        Если ДТС_Настройки.Пропустить(ОписаниеМетаданных.Идентификатор) Тогда
            Продолжить;
        КонецЕсли;
        
        НаборТестов = ДТС_НаборыТестов.НаборТестовБизнесПроцесса(ОписаниеМетаданных);
        ДТС_НаборыТестов.ДобавитьНаборТестов(
            ОписаниеМетаданных.Идентификатор, 
            ОписаниеМетаданных.Представление, 
            НаборТестов
        );
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ИдентификаторМодуля() 
    
    Возврат "БизнесПроцесс";
    
КонецФункции

#КонецОбласти
