
#Область СлужебныйПрограммныйИнтерфейс

// 
////
Процедура ДобавитьНаборТестов(СтруктураМетаданных, НаборТестов) Экспорт 
    
    ЮТТесты.ДобавитьТестовыйНабор(СтруктураМетаданных.Представление);
    
    Для Каждого Тест Из НаборТестов Цикл
        ЮТТесты.ДобавитьТест(Тест.Метод, Тест.Представление, Тест.Теги)
            .СПараметрами(СтруктураМетаданных.Имя);
    КонецЦикла;
    
КонецПроцедуры

#Область НаборыТестов

// 
////
Функция НаборТестовСправочники(Иерархический, Подчиненный, Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    
    Если Подчиненный Тогда
        // TODO
        Возврат Массив;
    КонецЕсли;
    
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Если Иерархический Тогда
        Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбораГруппы(Теги));
        Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуГруппы(Теги));
    КонецЕсли;
    
    Возврат Массив;
    
КонецФункции

//  
////
Функция НаборТестовДокументы(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовЖурналыДокументов(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовПеречисления(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовОтчеты(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВарианта(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуНастроек(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовОбработки(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФорму(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовПланыВидовХарактеристик(Иерархический, Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Если Иерархический Тогда
        Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбораГруппы(Теги));
        Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуГруппы(Теги));
    КонецЕсли;
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовПланыСчетов(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовПланыВидовРасчета(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовРегистрыСведений(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуЗаписи(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовРегистрыНакопления(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовРегистрыБухгалтерии(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовРегистрыРасчета(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовБизнесПроцессы(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовЗадачи(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовПланыОбмена(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуВыбора(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуОбъекта(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовКритерииОтбора(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСписка(Теги));
    
    Возврат Массив;
    
КонецФункции

// 
////
Функция НаборТестовХранилищаНастроек(Теги) Экспорт 
    
    Массив = Новый Массив;
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуЗагрузки(Теги));
    Массив.Добавить(ДымовыеТесты_Тесты.ОписаниеТестаОткрытьФормуСохранения(Теги));
    
    Возврат Массив;
    
КонецФункции

#КонецОбласти

#КонецОбласти
