
#Область СлужебныйПрограммныйИнтерфейс

#Область Тесты

// 
////
Процедура ОткрытьФормуЗагрузки(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуЗагрузки(Параметры);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуСохранения(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуСохранения(Параметры);
    
КонецПроцедуры

// 
////
Процедура ПроверитьМакетСКД(Параметры) Экспорт 
    
    ДТС_Тесты.ПроверитьМакетСКД(Параметры);
    
КонецПроцедуры

#КонецОбласти

// 
////
Процедура ИсполняемыеСценарии() Экспорт 
    
    Если ДТС_Настройки.Пропустить(ИдентификаторМодуля()) Тогда
        Возврат;
    КонецЕсли;
    
    МетаданныеХранилищаНастроек = ДТС_МетаданныеСервер.МетаданныеХранилищНастроек();
    
    Для Каждого ОписаниеМетаданных Из МетаданныеХранилищаНастроек Цикл
        Если ДТС_Настройки.Пропустить(ОписаниеМетаданных.Идентификатор) Тогда
            Продолжить;
        КонецЕсли;
        
        НаборТестов = ДТС_НаборыТестов.НаборТестовХранилищаНастроек(ОписаниеМетаданных);
        ДТС_НаборыТестов.ДобавитьНаборТестов(
            ОписаниеМетаданных.Идентификатор, 
            ОписаниеМетаданных.Представление, 
            НаборТестов
        );
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ИдентификаторМодуля() 
    
    Возврат "ХранилищеНастроек";
    
КонецФункции

#КонецОбласти
