
#Область ПрограммныйИнтерфейс

//  
////
Процедура ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт 
    
    МассивМетаданных = ДымовыеТесты_Метаданные.МетаданныеПланыВидовХарактеристик();
    
    Для Каждого ЭлементМассива Из МассивМетаданных Цикл
        НаборТестов = ДымовыеТесты_НаборыТестов.НаборТестовПланыВидовХарактеристик(
            ЭлементМассива.Иерархический, 
            Теги()
        );
        ДымовыеТесты_НаборыТестов.ДобавитьНаборТестов(ЭлементМассива, НаборТестов);
    КонецЦикла;
    
КонецПроцедуры

#Область Тесты

// 
////
Процедура ОткрытьФормуСписка(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуСписка(ТипМетаданных(), Имя);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВыбора(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуВыбора(ТипМетаданных(), Имя);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуОбъекта(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуОбъекта(ТипМетаданных(), Имя);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВыбораГруппы(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуВыбораГруппы(ТипМетаданных(), Имя);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуГруппы(Имя) Экспорт 
    
    ДымовыеТесты_Тесты.ОткрытьФормуГруппы(ТипМетаданных(), Имя);
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ТипМетаданных() 
    
    Возврат "ПланВидовХарактеристик";
    
КонецФункции

// 
////
Функция Теги() 
    
    Возврат "ПланВидовХарактеристик";
    
КонецФункции

#КонецОбласти
