
#Область СлужебныйПрограммныйИнтерфейс

#Область НаборыТестов

// 
////
Функция НаборТестовСправочника(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    
    // TODO
    Если НЕ ОписаниеМетаданных.Подчиненный Тогда
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоОбъекта(ОписаниеМетаданных));
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующийОбъект(ОписаниеМетаданных));
        
        Если ОписаниеМетаданных.Иерархический Тогда
            НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбораГруппы(ОписаниеМетаданных));
            НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуГруппы(ОписаниеМетаданных));
            НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующейГруппы(ОписаниеМетаданных));
            НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующуюГруппу(ОписаниеМетаданных));
        КонецЕсли;
    КонецЕсли;
    
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

//  
////
Функция НаборТестовДокумента(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующийОбъект(ОписаниеМетаданных));
    
    Если ОписаниеМетаданных.Проведение Тогда
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоПроведенногоОбъекта(ОписаниеМетаданных));
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаПровестиСуществующийОбъект(ОписаниеМетаданных));
    КонецЕсли;
    
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовЖурналаДокументов(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовПеречисления(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовОтчета(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВарианта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуНастроек(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовОбработки(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФорму(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовПланаВидовХарактеристик(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующийОбъект(ОписаниеМетаданных));
    
    Если ОписаниеМетаданных.Иерархический Тогда
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбораГруппы(ОписаниеМетаданных));
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуГруппы(ОписаниеМетаданных));
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующейГруппы(ОписаниеМетаданных));
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующуюГруппу(ОписаниеМетаданных));
    КонецЕсли;
    
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовПланаСчетов(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующийОбъект(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовПланаВидовРасчета(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовРегистраСведений(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуЗаписи(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующейЗаписи(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовРегистраНакопления(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    // TODO
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовРегистраБухгалтерии(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    // TODO
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовРегистраРасчета(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    // TODO
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовБизнесПроцесса(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующийОбъект(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовЗадачи(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующийОбъект(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовПланаОбмена(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуВыбора(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСуществующегоОбъекта(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаЗаписатьСуществующийОбъект(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовКритерияОтбора(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСписка(ОписаниеМетаданных));
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовХранилищаНастроек(ОписаниеМетаданных) Экспорт 
    
    НаборТестов = Новый Массив;
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуЗагрузки(ОписаниеМетаданных));
    НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьФормуСохранения(ОписаниеМетаданных));
    ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных);
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовОбщейФормы(МетаданныеОбщихФормы) Экспорт 
    
    НаборТестов = Новый Массив;
    
    Для Каждого ОписаниеМетаданных Из МетаданныеОбщихФормы Цикл
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаОткрытьОбщуюФорму(ОписаниеМетаданных));
    КонецЦикла;
    
    Возврат НаборТестов;
    
КонецФункции

// 
////
Функция НаборТестовОбщигоМакета(МетаданныеОбщихМакетов) Экспорт 
    
    НаборТестов = Новый Массив;
    
    Для Каждого ОписаниеМетаданных Из МетаданныеОбщихМакетов Цикл
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаПроверитьОбщийМакетСКД(ОписаниеМетаданных));
    КонецЦикла;
    
    Возврат НаборТестов;
    
КонецФункции

#КонецОбласти

// 
////
Процедура ДобавитьНаборТестов(Идентификатор, Представление, НаборТестов) Экспорт 
    
    ЮТТесты.ДобавитьТестовыйНабор(Идентификатор);
    
    Для Каждого Тест Из НаборТестов Цикл
        Если ДТС_Настройки.Пропустить(Тест.Идентификатор) Тогда
            Возврат;
        КонецЕсли;
        
        ЮТТесты.ДобавитьТест(Тест.Метод, Тест.Представление).СПараметрами(Тест.Параметры);
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Процедура ДополнитьНаборТестовМакетамиСКД(НаборТестов, ОписаниеМетаданных) 
    
    Для Каждого Макет Из ОписаниеМетаданных.МакетыСКД Цикл
        НаборТестов.Добавить(ДТС_Тесты.ОписаниеТестаПроверитьМакетСКД(ОписаниеМетаданных, Макет));
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти
