
#Область СлужебныйПрограммныйИнтерфейс

#Область Тесты

// 
////
Процедура ОткрытьФормуОбъекта(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуОбъекта(Параметры);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуВарианта(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуВарианта(Параметры);
    
КонецПроцедуры

// 
////
Процедура ОткрытьФормуНастроек(Параметры) Экспорт 
    
    ДТС_Тесты.ОткрытьФормуНастроек(Параметры);
    
КонецПроцедуры

// 
////
Процедура ПроверитьМакетСКД(Параметры) Экспорт 
    
    ДТС_Тесты.ПроверитьМакетСКД(Параметры);
    
КонецПроцедуры

#КонецОбласти

// 
////
Процедура ИсполняемыеСценарии() Экспорт 
    
    Если ДТС_Настройки.Пропустить(ИдентификаторМодуля()) Тогда
        Возврат;
    КонецЕсли;
    
    МетаданныеОтчеты = ДТС_МетаданныеСервер.МетаданныеОтчетов();
    
    Для Каждого ОписаниеМетаданных Из МетаданныеОтчеты Цикл
        Если ДТС_Настройки.Пропустить(ОписаниеМетаданных.Идентификатор) Тогда
            Продолжить;
        КонецЕсли;
        
        НаборТестов = ДТС_НаборыТестов.НаборТестовОтчета(ОписаниеМетаданных);
        ДТС_НаборыТестов.ДобавитьНаборТестов(
            ОписаниеМетаданных.Идентификатор, 
            ОписаниеМетаданных.Представление, 
            НаборТестов
        );
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// 
////
Функция ИдентификаторМодуля() 
    
    Возврат "Отчет";
    
КонецФункции

#КонецОбласти
